# forge-provision Brewfile — apps installed via Homebrew on this Mac.
# Apply with: brew bundle install --file=manifests/Brewfile
# Reference: https://github.com/Homebrew/homebrew-bundle

# Proton suite (the user is a Proton co-founder — defaults to Proton-native).
cask "proton-drive"
cask "proton-mail"
cask "proton-mail-bridge"
cask "proton-meet"
cask "proton-pass"
cask "protonvpn"

# Local LLM runner.
cask "lm-studio"

# AI coding agent (CLI). Configured locally with lm-studio + Proton Lumo as providers.
# Config TBD — capture as scripts/configure/opencode.sh once provider files settle.
brew "opencode"

# Modern rsync 3+ (Apple ships openrsync 2.6.9-compatible which lacks --info=progress2 etc).
# scripts/migrate/claude-history.sh requires this.
brew "rsync"

# Rust toolchain — required to build forge-cli from source.
# Alternative for end-users: download a prebuilt release from github.com/N4M3Z/forge-cli/releases.
brew "rust"

# GitHub CLI — repo creation, ssh-key registration, gh auth.
brew "gh"

# JSON munging — used by scripts/configure/claude-settings.sh to merge settings into ~/.claude/settings.json.
brew "jq"

# RTK (Rust Token Killer) — CLI proxy that compacts dev-tool output, 60–90% token savings.
# Wired into Claude Code via ~/.claude/hooks/rtk-rewrite.sh (see scripts/configure/rtk-hook.sh).
brew "rtk"

# Captured 2026-05-11 — installed via `brew install` manually.
cask "microsoft-teams"
cask "steam"
cask "visual-studio-code"
