# forge-provision Brewfile — apps installed via Homebrew on this Mac.
# Apply with: brew bundle install --file=manifests/Brewfile
# Reference: https://github.com/Homebrew/homebrew-bundle

# Proton suite (the user is a Proton co-founder — defaults to Proton-native).
cask "proton-drive"
cask "proton-mail"
cask "proton-mail-bridge"
cask "proton-meet"
cask "proton-pass"
cask "protonvpn"

# Local LLM runner.
cask "lm-studio"

# AI coding agent (CLI). Configured locally with lm-studio + Proton Lumo as providers.
# Config TBD — capture as scripts/configure/opencode.sh once provider files settle.
brew "opencode"

# Modern rsync 3+ (Apple ships openrsync 2.6.9-compatible which lacks --info=progress2 etc).
# scripts/migrate/claude-history.sh requires this.
brew "rsync"

# Rust toolchain — required to build forge-cli from source.
# Alternative for end-users: download a prebuilt release from github.com/N4M3Z/forge-cli/releases.
brew "rust"

# GitHub CLI — repo creation, ssh-key registration, gh auth.
brew "gh"

# JSON munging — used by scripts/configure/claude-settings.sh to merge settings into ~/.claude/settings.json.
brew "jq"

# RTK (Rust Token Killer) — CLI proxy that compacts dev-tool output, 60–90% token savings.
# Wired into Claude Code via ~/.claude/hooks/rtk-rewrite.sh (see scripts/configure/rtk-hook.sh).
brew "rtk"

# GitLab CLI — sibling to gh for GitLab repos.
brew "glab"

# Yubico Authenticator — modern GUI for FIDO2 / PIV / OATH / OpenPGP slot management.
# Replaces the discontinued yubico-yubikey-manager cask (disabled upstream 2025-07-27).
cask "yubico-authenticator"

# OpenSSH (brew's build) — bundled with FIDO2 security-key support (pulls libfido2 as a dep).
# macOS's /usr/bin/ssh* binaries know the ed25519-sk algorithm but lack the FIDO middleware,
# so scripts/install/ssh-yubikey-key.sh calls /opt/homebrew/bin/ssh-keygen explicitly.
brew "openssh"

# Native macOS ssh-askpass GUI — pops a Cocoa dialog for FIDO2 PIN entry. Without it,
# git commits signed via SSH hang waiting on a TTY prompt when run from non-interactive
# contexts (CI, agents, etc.). Configured via SSH_ASKPASS env var.
tap "theseal/ssh-askpass"
brew "theseal/ssh-askpass/ssh-askpass"

# gitleaks — pattern-based secret scanner. Catches AWS keys, tokens, PEM blocks,
# entropy-flagged strings in git history + working tree. Deterministic, fast, runs
# locally (no LLM). Pairs with deeper LLM-based scans via the SecretScan skill.
brew "gitleaks"

# GitHub Desktop — GUI client.
cask "github"

# Dotfiles engine (ARCH-0005). Manages canonical source at ~/Developer/N4M3Z/dotfiles/
# with copy-or-symlink laydown into $HOME plus templating for per-machine variance.
brew "chezmoi"

# Shell prompt (ARCH-0007). Rust binary, cross-shell, overrides Prezto's prompt module.
brew "starship"

# Shell history with SQLite backend (ARCH-0007). Replaces zsh-history-substring-search:
# search_mode_shell_up_key_binding="fulltext" gives substring-on-Up against atuin.
brew "atuin"

# JavaScript runtime and global package installer, primary (PROV-0004).
# Used for `bun install -g @cometix/ccline` plus future global npm tools.
tap "oven-sh/bun"
brew "oven-sh/bun/bun"

# JavaScript runtime, fallback (PROV-0004). Some npm packages still assume Node.
brew "node"

# Mac App Store CLI for inventory and reinstalls.
brew "mas"

# YAML/JSON processor (mikefarah's, NOT Andrey Kislyuk's Python yq). Required by
# scripts/audit-dotfiles.sh in the AuditDotfiles skill (forge-dev).
brew "yq"

# Captured 2026-05-11, installed via `brew install` manually.
cask "microsoft-teams"
cask "steam"
cask "visual-studio-code"
cask "raycast"
